package yueshenginfo.com.mynovel.module.home.dto;

import yueshenginfo.com.IBaseDto;

/**
 * Created by huchao on 2016/12/6.
 * Email 1064224874@qq.com
 */
public class BookContentDto extends IBaseDto {

    /**
     * ok : true
     * chapter : {"title":"第二章 姜初然","body":"突然一阵手机铃声响起，把陈凡惊醒过来，他拿出手机一看。\n来电显示两个字：\n\u201c老妈！\u201d\n\u201c喂，小凡吗？你应该快到楚州了吧。你唐姨应该在车站外等你了，我拖她在楚州找了房子，帮我照顾你。你好好的在楚州读书啊。\u201d\n\u201c你也别怪妈妈心狠，你也知道自己的成绩，如果不努力连好大学都上不了。所以妈妈才找关系把你送到市里最好的常青藤中学。\u201d\n\u201c你在楚州多听唐姨的话，她是妈妈在楚州早年的合作伙伴，人很好的。\u201d\n听着耳边数百年未听过的严厉女声，陈凡心中仿佛有一股暖流经过，眼角不知不觉中湿润了。\n\u201c妈，我知道的。你放心吧，我会在楚州好好读书的。\u201d\n陈凡低声道。\n自从他大学毕业那年母亲去世后，他就在再也没有听过她的声音了。\n在陈凡前世的记忆中，母亲是个很遥远的名词。他们见面的时间并不多。\n王晓云是个好强的人，在王家受到嘲讽和白眼后，她就想作出成绩给王家看看。所以在陈凡很小的时候就带着陈凡的姐姐安雅，母女两人跑去了中海，白手起家创建了锦绣集团。到了陈凡上大学时，锦绣集团已经成功上市，成为中海市地产界的巨头，王晓云更是身价数十亿，号称中海地产界的女皇！\n可惜后来母亲出了车祸，锦绣集团也被沈家的万荣集团吞并，陈凡只能一个人落魄回到楚州。\n妈妈几乎每年才回来一两次，所以陈凡对她的印象并不深。\n但当她出车祸后，陈凡才发现自己内心是多依赖她。她是整个家庭的支柱和信念。陈凡还记得父亲接到消息后，一夜时间头发就花白大半，仿佛精气神都被抽走了。\n\u201c对了，你唐姨家有个小女孩，叫姜初然，成绩非常好。你唐姨说了，想撮合你们两认识下。妈妈也不反对，但成绩是第一位，你可别关顾着谈恋爱把学习忘了。\u201d\n王晓云一字一句的叮嘱道。\n陈凡这时也不得不笑出声来，哪有这样的妈妈，孩子还上着高三呢，就想着让他们谈恋爱了。\n他无奈道：\u201c妈，我肯定考个好学校。你在中海也要多注意身体和安全，凡事别太累到。姐姐不是已经快毕业了嘛，你让她多帮忙，自己也轻松点。\u201d\n\u201c好啦、好啦，什么时候都开始管起你妈了。我知道了，公司还有事，我先挂了。钱已经打在你卡里面，省着点用啊。\u201d\n王晓云打了个哈哈，飞快的说完后就挂了电话。\n陈凡笑了笑摇头。\n他母亲虽然是女强人，但一直做事很毛糙。如果不是姐姐安雅在旁边看着，还不知道出多少纰漏呢。\n想起安雅，他心中不由一痛。\n如果说除了小琼之外，陈凡最大的遗憾是什么。那就是父母和安雅了。\n\u201c我前世终究是负了安姐姐，这一世不知道怎么报答她。\u201d\n陈凡默然，感情的事情，又怎是外人能说得清的。\n他正想着，金龙大巴已经到车站了，司机师傅吆喝让大家快下车。\n到了车站后，望着熟悉的楚州市汽车站还有川流不息的人群，陈凡一阵恍然，他这个时候才相信自己终于重生回来，再回17岁时的少年。\n\u201c凡尘俗世，终究要再走一遭的。这一世，我又有何惧。\u201d\n他淡淡一笑，跟着人流向站外走去。\n......\n此时楚州汽车站外，周围的乘客不时用惊艳的目光看着某处。\n一辆炫目拉风的进口红色奥迪A6停在那里。\n这车07年左右高配版能卖六七十万，在当时楚州算是豪车。这也不算什么，楚州虽然不是发达城市，在江南省也能排中上，保时捷法拉利等跑车都不少见。\n关键是车前站着的一大一小两个美女。\n大的看着三十多岁，面容姣好，穿着一身裁剪得体的黑色套裙，里面是白衬衫，肉色袜加高跟鞋，画着精致的妆容，一副成熟精英白领的打扮。\n小的还是豆蔻年华，十六七岁出头，身材高挑，长的和大美女有七分相似，但容貌更出众些，只是看着有些清冷高傲。\n自然是唐姨和她的女儿姜初然。\n此时的姜初然正皱着眉头，扫视着汽车站出站口。\n\u201c妈，他什么时候到啊，你要不打个电话催一下吧。\u201d姜初然不耐烦的道。\n\u201c你这孩子，才十分钟就等不及了。\u201d唐姨无奈的蹙了蹙眉。\n这是她早年在楚州最好姐妹家的小孩，要送来楚州读高三，又是从小到大第一次一个人出来读书，王晓云托付给她，她自然要尽心尽力。\n\u201c陈凡是个很老实的孩子，等会出来你多注意下说话。以后你们两是同学，要多多相处。他刚从泗水县来楚州，人生地不熟，你得多照顾一下他。\u201d唐姨叮嘱道。\n\u201c好啦，我知道了，妈，你别再说了。\u201d姜初然叹气道，心中一阵烦躁。\n就因为她妈妈姐妹家的小孩要来楚州上学，就把她大中午的拖到楚州汽车站外，站在这晒了十分钟的太阳。而且她今天下午还和闺蜜越好去星巴克喝咖啡呢，看这架势也要泡汤了。\n关键她妈妈好像有撮合两人的架势啊。小女孩在这方面很敏感，唐姨才提过两句，她心中就察觉到。顿时抵触情绪大增。连带着对那个还未见面的同学也不抱好感。\n这时，只听一声：\n\u201c唐姨，您久等了。\u201d\n一个男孩带着温和的笑容很有礼貌的在和她母亲打招呼。\n这就是陈凡？\n姜初然不动神色的扫视了一番。\n个头不高，一米七左右，她穿着帆布鞋都和他差不多了。\n相貌也不怎么样，路人级别，最多算清秀，谈不上帅气。\n关键以她不怎么精通名牌的眼光都能看出这人一身烂大街的牌子，衣服加裤子全身不超过一千。如果是她那个言必LV，行必普拉达的白富美闺蜜在这，肯定直接嘲讽了。\n姜初然眼中不由闪过一丝不屑。\n\u2018这个陈凡看着并不像很有能耐的，相比起李易晨他们差远了。\u2019姜初然心中暗暗摇头。\n李易晨是她的同学，校学生会主席，楚州副市长的儿子，是学校里面的风云人物。无论是长相还是家世能耐都是一等一的，同样也是姜初然的追求者，姜初然对他的感觉也非常好，两人在外界看来差不多算是一对了。\n唐姨笑眯眯的看着陈凡，对眼前这清秀少年她很满意，主动介绍道：\n\u201c小凡，这是我女儿姜初然。\u201d\n\u201c她下学期开学也上高三，和你一个学校，比你小三个月，你叫她然然就好了，以后你可要好好照顾她哦。\u201d\n陈凡点头笑道：\u201c放心吧，唐姨，以后然然就是我的妹妹，我会保护她的。\u201d\n他转过身来，看着这个自己前世曾经喜欢过，被伤过，又淡忘的女孩。\n姜初然！\n唐姨的女儿，他高三同学，也算是陈凡前世第一个喜欢上的女孩。\n当时07年国内虽然还没迎来房地产爆发期，他母亲也不是未来的中海地产界女皇，此时的陈凡只是一个十七年都生活在泗水县没怎么出来过的普通少年。\n\u2018当时我从落后的小县城跑到繁华的楚州，人生地不熟，骤然见到姜初然这样的楚州上层家庭富贵之女，又长的那样漂亮，加上唐姨的热心撮合，自然心生遐想。\u2019\n陈凡有些好笑，那是少年当时的情愫。\n\u201c可惜以姜初然的眼光之高，又怎会看上当时的我。\u201d\n他摇了摇头。\n\u201c记得当时她喜欢的是学校的风云人物，楚州副市长的儿子李易晨。后来两人还一起考去中海大学，双宿双飞，我那时颓废了很长时间。现在想来，确实可笑。\u201d\n他已经不再是五百年前那个他了。又怎会继续纠结这段未完成的暗恋呢？\n陈凡主动伸出手：\u201c你好，然然同学，我叫陈凡，来自泗水县，以后我们就是同学了，以后你有什么事情，尽管找我。\u201d\n尽管她曾经伤过自己，但她是唐姨的女儿，无论如何自己也保护好她，不让唐姨伤心。\n女孩见过很多被自己容貌惊艳到的人，如陈凡这般目光清澈的男孩很少，虽然长得不算帅，但好歹气质干净，看着舒服。\n\u2018可惜家世和能力有点差，只能做个普通朋友。\u2019\n少女心中暗叹，却大方的伸出白嫩的小手：\n\u201c好啊，到时候你可别忘记自己说的话哦。\u201d\n姜初然嘴上这么说，其实心中一笑而过，完全不当回事。\n她父亲是政府高官、母亲开公司资产千万、人长的又漂亮，许多追求者家里面都有权有势。又有什么事会劳烦到陈凡的？\n唐姨笑着道：\u201c快上车吧，先把你行礼放在新家，然后再去我们家吃中午饭，把你叔叔介绍给你认识。\u201d\n\u201c好的。\u201d陈凡笑着点头。\n上车之后，他们先开去了陈凡租房所在地。\n\u201c湖畔小区。\u201d\n这里是楚州中档居住小区，绿化很不错，关键靠近燕归湖，风景很美，离他读书所在的\u2018常青藤中学\u2019也不远，十分钟的步行路程。房间是三室一厅，精装修。空调、热水、浴缸、电视、沙发、冰箱应有尽有。可见唐姨为了找房也花了一番心思。\n\u201c谢谢唐姨，让您费心了。\u201d陈凡真心诚意的道谢。\n唐姨前世是少数几个真心对他好的人。\n她是母亲王晓云的合作伙伴，经营着一家建筑设计公司，资产数百万，也算是事业有成的女强人。\n上一世他高中时学习成绩不好，被他母亲送到了楚州市最好的私立高中\u2018常青藤中学\u2019读书，是唐姨一直照顾他。又是帮忙找租房，又天天让他去家中吃饭，还想撮合女儿给他认识。\n无论是他巅峰时，还是后来穷困落魄，唐姨都待他如故。\n\u201c看你这孩子说的，你妈把你托付给我，你在楚州就一个人，阿姨只有然然一个女儿，一直想要个儿子呢，以后你就把阿姨家当成自家。\u201d唐姨温柔的笑着说道。\n\u201c嗯。\u201d陈凡用力的点点头。\n他这一世回来，同样也想报答一下前世唐姨的恩情。\n唐姨感受到他话中的真诚，不由心中印象更好。相比起见过几面，但给她\u2018城府很深，不是良配\u2019印象的李易晨，唐姨更喜欢陈凡这样家庭背景不错，父亲当个小官、母亲经商，也能算上门当户对，关键人又很老实，看着就让人放心的孩子。\n出了湖畔小区，车向唐姨家开去。\n姜初然和陈凡都坐在后座，两人不咸不淡的谈了几句，但互相的兴趣和交际圈子都不一样，没什么好谈的。陈凡干脆就歉意的一笑，主动向窗户边靠了靠，闭上双眼，一副很累的样子。\n姜初然等了等，见他不说话，就淡然扭头看向窗外。\n这个少年虽然给她初见面印象不错，但她在学校也是受人追捧的天之骄女，再加上眼光甚高，家教很严，陈凡还没到让她主动搭话的程度。\n而且她见多了想靠独立特行吸引女孩的把戏，现在小孩都懂什么叫反其道而行之。可惜姜大小姐不吃这一套，她只欣赏真正有能耐的人。\n可惜陈凡没她想的那么多，他正在思考这一世的修行问题。"}
     */

    private boolean ok;
    /**
     * title : 第二章 姜初然
     * body : 突然一阵手机铃声响起，把陈凡惊醒过来，他拿出手机一看。
     来电显示两个字：
     “老妈！”
     “喂，小凡吗？你应该快到楚州了吧。你唐姨应该在车站外等你了，我拖她在楚州找了房子，帮我照顾你。你好好的在楚州读书啊。”
     “你也别怪妈妈心狠，你也知道自己的成绩，如果不努力连好大学都上不了。所以妈妈才找关系把你送到市里最好的常青藤中学。”
     “你在楚州多听唐姨的话，她是妈妈在楚州早年的合作伙伴，人很好的。”
     听着耳边数百年未听过的严厉女声，陈凡心中仿佛有一股暖流经过，眼角不知不觉中湿润了。
     “妈，我知道的。你放心吧，我会在楚州好好读书的。”
     陈凡低声道。
     自从他大学毕业那年母亲去世后，他就在再也没有听过她的声音了。
     在陈凡前世的记忆中，母亲是个很遥远的名词。他们见面的时间并不多。
     王晓云是个好强的人，在王家受到嘲讽和白眼后，她就想作出成绩给王家看看。所以在陈凡很小的时候就带着陈凡的姐姐安雅，母女两人跑去了中海，白手起家创建了锦绣集团。到了陈凡上大学时，锦绣集团已经成功上市，成为中海市地产界的巨头，王晓云更是身价数十亿，号称中海地产界的女皇！
     可惜后来母亲出了车祸，锦绣集团也被沈家的万荣集团吞并，陈凡只能一个人落魄回到楚州。
     妈妈几乎每年才回来一两次，所以陈凡对她的印象并不深。
     但当她出车祸后，陈凡才发现自己内心是多依赖她。她是整个家庭的支柱和信念。陈凡还记得父亲接到消息后，一夜时间头发就花白大半，仿佛精气神都被抽走了。
     “对了，你唐姨家有个小女孩，叫姜初然，成绩非常好。你唐姨说了，想撮合你们两认识下。妈妈也不反对，但成绩是第一位，你可别关顾着谈恋爱把学习忘了。”
     王晓云一字一句的叮嘱道。
     陈凡这时也不得不笑出声来，哪有这样的妈妈，孩子还上着高三呢，就想着让他们谈恋爱了。
     他无奈道：“妈，我肯定考个好学校。你在中海也要多注意身体和安全，凡事别太累到。姐姐不是已经快毕业了嘛，你让她多帮忙，自己也轻松点。”
     “好啦、好啦，什么时候都开始管起你妈了。我知道了，公司还有事，我先挂了。钱已经打在你卡里面，省着点用啊。”
     王晓云打了个哈哈，飞快的说完后就挂了电话。
     陈凡笑了笑摇头。
     他母亲虽然是女强人，但一直做事很毛糙。如果不是姐姐安雅在旁边看着，还不知道出多少纰漏呢。
     想起安雅，他心中不由一痛。
     如果说除了小琼之外，陈凡最大的遗憾是什么。那就是父母和安雅了。
     “我前世终究是负了安姐姐，这一世不知道怎么报答她。”
     陈凡默然，感情的事情，又怎是外人能说得清的。
     他正想着，金龙大巴已经到车站了，司机师傅吆喝让大家快下车。
     到了车站后，望着熟悉的楚州市汽车站还有川流不息的人群，陈凡一阵恍然，他这个时候才相信自己终于重生回来，再回17岁时的少年。
     “凡尘俗世，终究要再走一遭的。这一世，我又有何惧。”
     他淡淡一笑，跟着人流向站外走去。
     ......
     此时楚州汽车站外，周围的乘客不时用惊艳的目光看着某处。
     一辆炫目拉风的进口红色奥迪A6停在那里。
     这车07年左右高配版能卖六七十万，在当时楚州算是豪车。这也不算什么，楚州虽然不是发达城市，在江南省也能排中上，保时捷法拉利等跑车都不少见。
     关键是车前站着的一大一小两个美女。
     大的看着三十多岁，面容姣好，穿着一身裁剪得体的黑色套裙，里面是白衬衫，肉色袜加高跟鞋，画着精致的妆容，一副成熟精英白领的打扮。
     小的还是豆蔻年华，十六七岁出头，身材高挑，长的和大美女有七分相似，但容貌更出众些，只是看着有些清冷高傲。
     自然是唐姨和她的女儿姜初然。
     此时的姜初然正皱着眉头，扫视着汽车站出站口。
     “妈，他什么时候到啊，你要不打个电话催一下吧。”姜初然不耐烦的道。
     “你这孩子，才十分钟就等不及了。”唐姨无奈的蹙了蹙眉。
     这是她早年在楚州最好姐妹家的小孩，要送来楚州读高三，又是从小到大第一次一个人出来读书，王晓云托付给她，她自然要尽心尽力。
     “陈凡是个很老实的孩子，等会出来你多注意下说话。以后你们两是同学，要多多相处。他刚从泗水县来楚州，人生地不熟，你得多照顾一下他。”唐姨叮嘱道。
     “好啦，我知道了，妈，你别再说了。”姜初然叹气道，心中一阵烦躁。
     就因为她妈妈姐妹家的小孩要来楚州上学，就把她大中午的拖到楚州汽车站外，站在这晒了十分钟的太阳。而且她今天下午还和闺蜜越好去星巴克喝咖啡呢，看这架势也要泡汤了。
     关键她妈妈好像有撮合两人的架势啊。小女孩在这方面很敏感，唐姨才提过两句，她心中就察觉到。顿时抵触情绪大增。连带着对那个还未见面的同学也不抱好感。
     这时，只听一声：
     “唐姨，您久等了。”
     一个男孩带着温和的笑容很有礼貌的在和她母亲打招呼。
     这就是陈凡？
     姜初然不动神色的扫视了一番。
     个头不高，一米七左右，她穿着帆布鞋都和他差不多了。
     相貌也不怎么样，路人级别，最多算清秀，谈不上帅气。
     关键以她不怎么精通名牌的眼光都能看出这人一身烂大街的牌子，衣服加裤子全身不超过一千。如果是她那个言必LV，行必普拉达的白富美闺蜜在这，肯定直接嘲讽了。
     姜初然眼中不由闪过一丝不屑。
     ‘这个陈凡看着并不像很有能耐的，相比起李易晨他们差远了。’姜初然心中暗暗摇头。
     李易晨是她的同学，校学生会主席，楚州副市长的儿子，是学校里面的风云人物。无论是长相还是家世能耐都是一等一的，同样也是姜初然的追求者，姜初然对他的感觉也非常好，两人在外界看来差不多算是一对了。
     唐姨笑眯眯的看着陈凡，对眼前这清秀少年她很满意，主动介绍道：
     “小凡，这是我女儿姜初然。”
     “她下学期开学也上高三，和你一个学校，比你小三个月，你叫她然然就好了，以后你可要好好照顾她哦。”
     陈凡点头笑道：“放心吧，唐姨，以后然然就是我的妹妹，我会保护她的。”
     他转过身来，看着这个自己前世曾经喜欢过，被伤过，又淡忘的女孩。
     姜初然！
     唐姨的女儿，他高三同学，也算是陈凡前世第一个喜欢上的女孩。
     当时07年国内虽然还没迎来房地产爆发期，他母亲也不是未来的中海地产界女皇，此时的陈凡只是一个十七年都生活在泗水县没怎么出来过的普通少年。
     ‘当时我从落后的小县城跑到繁华的楚州，人生地不熟，骤然见到姜初然这样的楚州上层家庭富贵之女，又长的那样漂亮，加上唐姨的热心撮合，自然心生遐想。’
     陈凡有些好笑，那是少年当时的情愫。
     “可惜以姜初然的眼光之高，又怎会看上当时的我。”
     他摇了摇头。
     “记得当时她喜欢的是学校的风云人物，楚州副市长的儿子李易晨。后来两人还一起考去中海大学，双宿双飞，我那时颓废了很长时间。现在想来，确实可笑。”
     他已经不再是五百年前那个他了。又怎会继续纠结这段未完成的暗恋呢？
     陈凡主动伸出手：“你好，然然同学，我叫陈凡，来自泗水县，以后我们就是同学了，以后你有什么事情，尽管找我。”
     尽管她曾经伤过自己，但她是唐姨的女儿，无论如何自己也保护好她，不让唐姨伤心。
     女孩见过很多被自己容貌惊艳到的人，如陈凡这般目光清澈的男孩很少，虽然长得不算帅，但好歹气质干净，看着舒服。
     ‘可惜家世和能力有点差，只能做个普通朋友。’
     少女心中暗叹，却大方的伸出白嫩的小手：
     “好啊，到时候你可别忘记自己说的话哦。”
     姜初然嘴上这么说，其实心中一笑而过，完全不当回事。
     她父亲是政府高官、母亲开公司资产千万、人长的又漂亮，许多追求者家里面都有权有势。又有什么事会劳烦到陈凡的？
     唐姨笑着道：“快上车吧，先把你行礼放在新家，然后再去我们家吃中午饭，把你叔叔介绍给你认识。”
     “好的。”陈凡笑着点头。
     上车之后，他们先开去了陈凡租房所在地。
     “湖畔小区。”
     这里是楚州中档居住小区，绿化很不错，关键靠近燕归湖，风景很美，离他读书所在的‘常青藤中学’也不远，十分钟的步行路程。房间是三室一厅，精装修。空调、热水、浴缸、电视、沙发、冰箱应有尽有。可见唐姨为了找房也花了一番心思。
     “谢谢唐姨，让您费心了。”陈凡真心诚意的道谢。
     唐姨前世是少数几个真心对他好的人。
     她是母亲王晓云的合作伙伴，经营着一家建筑设计公司，资产数百万，也算是事业有成的女强人。
     上一世他高中时学习成绩不好，被他母亲送到了楚州市最好的私立高中‘常青藤中学’读书，是唐姨一直照顾他。又是帮忙找租房，又天天让他去家中吃饭，还想撮合女儿给他认识。
     无论是他巅峰时，还是后来穷困落魄，唐姨都待他如故。
     “看你这孩子说的，你妈把你托付给我，你在楚州就一个人，阿姨只有然然一个女儿，一直想要个儿子呢，以后你就把阿姨家当成自家。”唐姨温柔的笑着说道。
     “嗯。”陈凡用力的点点头。
     他这一世回来，同样也想报答一下前世唐姨的恩情。
     唐姨感受到他话中的真诚，不由心中印象更好。相比起见过几面，但给她‘城府很深，不是良配’印象的李易晨，唐姨更喜欢陈凡这样家庭背景不错，父亲当个小官、母亲经商，也能算上门当户对，关键人又很老实，看着就让人放心的孩子。
     出了湖畔小区，车向唐姨家开去。
     姜初然和陈凡都坐在后座，两人不咸不淡的谈了几句，但互相的兴趣和交际圈子都不一样，没什么好谈的。陈凡干脆就歉意的一笑，主动向窗户边靠了靠，闭上双眼，一副很累的样子。
     姜初然等了等，见他不说话，就淡然扭头看向窗外。
     这个少年虽然给她初见面印象不错，但她在学校也是受人追捧的天之骄女，再加上眼光甚高，家教很严，陈凡还没到让她主动搭话的程度。
     而且她见多了想靠独立特行吸引女孩的把戏，现在小孩都懂什么叫反其道而行之。可惜姜大小姐不吃这一套，她只欣赏真正有能耐的人。
     可惜陈凡没她想的那么多，他正在思考这一世的修行问题。
     */

    private ChapterVO chapter;

    public boolean isOk() {
        return ok;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterVO getChapter() {
        return chapter;
    }

    public void setChapter(ChapterVO chapter) {
        this.chapter = chapter;
    }

    public static class ChapterVO {
        private String title;
        private String body;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public void setBody(String body) {
            this.body = body;
        }
    }
}
